import 'package:flutter/material.dart';
import 'package:get/get.dart';
// import 'package:intl/intl.dart';
import 'package:musan_client/src/ui/auth/SignUp.dart';

class TermsConditions extends StatefulWidget {
  const TermsConditions({Key key}) : super(key: key);

  @override
  _TermsConditionsState createState() => _TermsConditionsState();
}

class _TermsConditionsState extends State<TermsConditions> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      appBar: AppBar(
      elevation: 0,
      leading: Padding(
        padding: const EdgeInsets.all(8.0),
        child: InkWell(
          onTap: (){
            Get.back();
          },
          child: Container(

            decoration: BoxDecoration(border: Border.all(color: Colors.grey),
            borderRadius: BorderRadius.circular(10)),
            child: Center(child: Icon(Icons.arrow_back,color: Colors.blue,),),),
        ),
      ),
      backgroundColor: Colors.white,
      centerTitle: true,
      // title: Text("الشروط والأحكام",style: TextStyle(color: Colors.black),),
    ),
    body: Container(
      width: Get.width,

      child: Column(

        children: [
          SizedBox(height: 10,),
          Image.asset("assets/logo.png",height: 100,),
          Container(
            width: Get.width,
            child: Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
              Padding(
                padding: const EdgeInsets.all(8.0),
                child: Text("الشروط والأحكام",style: TextStyle(color: Colors.black,fontSize: 18,fontWeight: FontWeight.bold)),
              ),


            ],),
          ),
          Expanded(child: SingleChildScrollView(
            child: Column(

              crossAxisAlignment: CrossAxisAlignment.end,
              children: [
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text("سياسة الخصوصية الخاصة في تطبيق مصان لخدمة السيارات:-",textDirection: TextDirection.rtl,style: TextStyle(fontSize: 22,fontWeight: FontWeight.bold))
                ),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text(
                        'نشكركم على تسجيلكم بتطبيق مصان، ونؤكد لكم بأن بياناتكم الشخصية ستكون بأمان كامل معنا، ونرجو منكم العلم أن صفحة سياسة الخصوصية الخاصة بنا تشمل بنود هامة يجب أن يعرفها جميع المستخدمين قبل استخدامهم لتطبيقنا، وهذه البنود تتضمن البيانات الشخصية '
                            '\n\n 1-البيانات الشخصية التي نقوم بجمعها من المستخدمين وفيما نستخدم تلك البيانات: - نقوم بجمع بعض البيانات الشخصية من المستخدمين وذلك من أجل أن يتمكنوا من استخدام الخدمات المتنوعة التي يقدمها التطبيق، ومن أجل أن يتمكنوا من التسجيل بالتطبيق، ونقوم باستخدام بيانات المستخدمين من '
                        ,textDirection: TextDirection.rtl,style: TextStyle(fontSize: 15))
                ),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text(' 2- مسؤولية المستخدم تجاه حسابه في التطبيق: - يقوم المستخدم بإنشاء حساب في التطبيق ويكتب كلمة سر لحسابه ، فيجب عليه أن يحتفظ بكلمة'
                        ' السر ولا يسلمها لأي شخص لأن كشف المستخدم لكلمة السر الخاصة به قد يعرض حسابه للإيقاف والتطبيق لا يتحمل مسؤولية سوء استخدام الحساب.\n\n 3- حماية بيانات ووسائل الدفع الخاصة بمستخدمي تطبيقنا:- '
                        'تقع مسؤولية الحفاظ على بيانات المستخدمين الشخصية على إدارة التطبيق، ونستخدم أفضل الإجراءات للحفاظ على بيانات جميع المستخدمين. '
                        '\n\n4-  حقوق عملاؤنا المالية:- '
                        'نحافظ على بيانات وسائل الدفع الخاصة بالسادة العملاء، ونستخدم أفضل الإجراءات للقيام بذلك، وأيضاَ تطبيقنا مسؤول عن سرية التعاملات المالية التي تتم بيننا وبين العملاء. \n\n  5- إخلاء المسؤولية:- '
                        'يخلي تطبيق مصان مسؤوليته إذا حدث كشف عن البيانات الخاصة بالمستخدمين نتيجة لسبب خارج عن إرادتنا، وسنعمل بكل جهد على معالجة هذا الأمر بأقصى سرعة.  \n\n6-  حقوق تطبيق مصان لخدمة السيارات:- قت لأخر نجد ضرورة لعمل تغييرات وإضافات لصفحة سياسة الخصوصية الخاصة بنا ، لذلك نرجو من السادة '
                        'المستخدمين الاطلاع بشكل دوري على صفحة سياسة '
                        'الخصوصية الخاصة بنا ليكونوا على معرفة بأي إضافات أو تغييرات تم فعلها، وسنحاول ارسال إشعارات إلى السادة مستخدمي التطبيق لتعريفهم بأي تحديث تم إضافته أو تغييره بسياسة الخصوصية'
                        ,textDirection: TextDirection.rtl,style: TextStyle(fontSize: 15))

                ),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text("الشروط والأحكام الخاصة بتطبيق مصان لخدمة السيارات:-",textDirection: TextDirection.rtl,style: TextStyle(fontSize: 22,fontWeight: FontWeight.bold))
                ),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text('ترجو إدارة التطبيق من السادة المستخدمين أن يقرأوا بعناية صفحة الشروط والأحكام الخاصة بنا، لأن هذه الصفحة تعرفهم بشروط التطبيق الذي يجب عليهم إتباعها، لأن مخالفة تلك الشروط تعرض المستخدم المخالف للحظر من التطبيق. '
                        'أولاً: شروط عامة خاصة بتطبيق مصان لخدمة السيارات:- '
                        '\n\n 1- عند بدء المستخدم بعملية التسجيل بالتطبيق ، فهذا يعني أن قد قرأ شروط وأحكام التطبيق ، وموافق على هذه الشروط والأحكام ، ومن الممكن أن تقوم إدارة التطبيق'
                        ' بإضافة بعض البنود الجديدة إلى صفحة الشروط والأحكام الخاصة بها أو حتى إجراء بعض'
                        ' التعديلات لهذه الصفحة ، لذلك نرجو منكم رؤية هذه الصفحة من وقت لأخر لتعرفوا ما تم إضافته أو تعديله. \n\n2-'
                        ' تطبيق مصان غير موجه للأطفال ولا يمكن لمن هم دون 16 عام استخدام التطبيق ولا حتى الخدمات التي يقدمها.'
                        ' \n\n 3- يمكن للسادة العملاء استخدام وسائل الدفع المتاحة بالتطبيق والتي تساعدهم على إتمام طلباتهم ،'
                        ' ووسائل الدفع المتاحة بالتطبيق هي بطاقات الأئتمان وبطاقة مدى، وسيتم لاحقاً'
                        ' ادراج وسائل دفع إضافية تطبق عليها الشروط المماثلة التي تطبق على استخدام وسائل الدفع الحالية في التطبيق.'
                        '\n\n4-  يتيح التطبيق للعميل طلب إصلاح عطل معين بسيارته، وإذا كان العميل غير خبير بالشئون الفنية  '
                        ' والإصلاح فيمكنه بكل سهولة طلب خدمة (فني زائر) لفحص سيارته وإخباره بالأعطال الموجودة بالسيارة ، وسيصل الفني إلى موقعك، وسوف يخبرك '
                        'الفني بالاعطال الموجود بسيارتك والتكاليف التقريبية لإصلاح تلك الأعطال، وهنا لا تتحمل إدارة التطبيق عدم اتفاق الطرفين او حدوث خلافات.'
                        '\n\n5- إعطاء العميل السعر للإصلاح من الفني الزائر هو سعر تقريبي قد يتغير عند معاينة السيارة في الورشة.'
                        ' \n\n6- قبول العميل للعرض المقدم له من الورشة عبر التطبيق لايعتبر اتفاق نهائي ولا يتم الزام الورشة بالسعر الأول في التطبيق اذا ثبت ان السيارة بحاجة الى اعمال اضافية.  \n\n7-'
                        '- يمنع استخدام الخدمات التي يقدمها تطبيق مصان في أغراض غير قانونية، ويعاقب من يفعل ذلك بحظر حسابه من التطبيق.'
                        '\n\n8- تطبيق مصان غير مسؤول عن جودة الخدمات التي تقدمها ورش الإصلاح المتعاقد معها.'
                        ' \n\n9- تطبيق مصان غير مسؤول عن أي خلافات تحدث بين العميل والورشة مهما كان نوعها.' ,textDirection: TextDirection.rtl,style: TextStyle(fontSize: 15))
                ),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text("ثانيا: شروط التعامل مع تطبيق مصان لخدمة السيارات:-",textDirection: TextDirection.rtl,style: TextStyle(fontSize: 22,fontWeight: FontWeight.bold))
                ),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text('1- يجب على كافة المستخدمين تزويد التطبيق بالبيانات الصحيحة التي يحتاجها منهم حتى يتمكنوا من استخدام خدماته.'
                        '\n\n2- يقوم المستخدمين باستخدام الخدمات التي يقدمها التطبيق بشكل مناسب ، وإلا يقوم أي مستخدم بمحاولة غش أو الاحتيال على مستخدمي التطبيق.'
                        '\n\n3- يمنع تماماً لأي مستخدم أن يتسبب بأي ضرر سواء لمستخدم آخر أو لتطبيق مصان ، ومن يفعل ذلك من الممكن أن يعرض حسابه للحظر من التطبيق والملاحقة القانونية.'
                        '\n\n4- تطبيق مصان غير مسؤول عن ورش الصيانة المتعاقد معها أو كيفية تعاملها مع العملاء، التطبيق عبارة عن وسيط بين مستخدمي التطبيق وبين هذه الورش وليس جهة ضامنة.'
                        '\n\n5- لا تقع أي مسؤولية على تطبيق مصان في حالة تأخر الفني (الزائر) عن الوقت المحدد مع العميل.'
                        '\n\n6- في حالة طلب العميل للفني (الزائر) فإن معلومات التواصل التي يقوم العميل بتزويدها للفني تعتبر مسؤولية العميل ولا تقع أي مسؤولية على تطبيق مصان.'
                        '\n\n7- ورش الصيانة التي تظهر في محركات البحث الخاصة بالتطبيق هم عبارة عن الورش المختصة بالصيانة ولا تقع أي مسؤولية علينا إذا وجد العميل الأمر خلاف ذلك.'
                        '\n\n8- يمتلك تطبيق مصان حقوق فكرية وتشمل تلك الحقوق صفحة الشروط والأحكام والشعار وجميع أنواع '
                        'المحتوى الموجود بتطبيق مصان، ويمنع على أي شخص إنتهاك حقوق تطبيق مصان ، ومن ينتهك حقوق تطبيق مصان فإنه بذلك سيعرض نفسه للملاحقة القضائية من قبل إدارة التطبيق.'
                        ,textDirection: TextDirection.rtl,style: TextStyle(fontSize: 15))
                ),
                Row(children: [
                  Padding(
                      padding: const EdgeInsets.all(8.0),
                      child: Text("سياسة الإسترجاع:-",textDirection: TextDirection.rtl,style: TextStyle(fontSize: 22,fontWeight: FontWeight.bold))
                  ),
                ],),
                Padding(
                    padding: const EdgeInsets.all(8.0),
                    child: Text('1- إذا لم تقوم ورشة الإصلاح بتنفيذ الإصلاحات المطلوبة منهم فإن مسؤولية ارجاع المبلغ يقع على الورشة المتعاقد معها العميل.'
                        '\n\n2-'
                        ' في حالة لم يصل إليك الفني (الزائر) على الإطلاق فإن التطبيق سيعيد المبلغ اذا كان قد تم الدفع عبر الوسائل الإلكترونية المتاحة في التطبيق.'
                        '\n\n3- في حالة عدم رغبتك بإصلاح السيارة عند'
                        ' الورشة المتعاقد معها للإصلاح نتيجة سبب واضح (قبل بدء عملية الإصلاح)، يجب عليك في هذه الحالة دفع رسوم فحص السيارة من قبل الورشة.'

                        ,textDirection: TextDirection.rtl,style: TextStyle(fontSize: 15))
                ),




              ],
            ),),)

      ],),
    ),);
  }
}


